Updating linting and switch to use mermaid diagrams for onboarding docs
